In [1]:
import pandas as pd

# Merging DataFrames Notebook

For the career village recommender system, we were given 15 CSV's to work with. To make future processing easier and to find significant relationships, we're merging relevant DataFrames. This notebook is specifically dedicated to merging DataFrames. After opening and playing around with the dataframes I realized that merging them wouldn't be as simple as I had hoped. The dataframes don't line up well, and when merging I'd either lose or make up information. In this notebook, I did an initial run at merging the notebooks so that I could delve further into the data, do some cleaning and EDA. After cleaning and EDA, I tweaked how I merged the data for optimal information. For best results, it would be beneficial to spend more time fitting the datasets together with minimal data loss and minimal simulated information. 

For general cleaning, EDA, and modeling I merged:
- answers.csv
- answer_scores.csv
- question_scores.csv
- questions.csv
- tag_questions.csv
- tags.csv
- professionals.csv

## <span style = 'color:red'> include image </span>
    
To do this I did, I first merged the answers CSV's together, the just the questions CSVs, then just the tag CSVs. Once I had three merged notebooks then I merged those notebooks. 

## <span style = 'color:red'> explain how </span>


To further explore the relationships that tags have with how questions are being answered I merged:
(and to avoid issues of making up or losing information)

## <span style = 'color:red'> List </span>
    
With the data provided, there was only a sparse data dictionary with just a note about what the notebook was. There wasn't an explicit explanation for what the specific columns meant and what was compatible with what. After playing around with a few of the notebooks I assumed that **these** columns were compatible with each other and merged on those columns.

#### CSV's Used:

In [2]:
# Answers
answers_df = pd.read_csv('./Datasets/provided_csvs/answers.csv')
answer_score_df = pd.read_csv('./Datasets/provided_csvs/answer_scores.csv')

# Questions
q_score_df = pd.read_csv('./Datasets/provided_csvs/question_scores.csv')
ques_df = pd.read_csv('./Datasets/provided_csvs/questions.csv')

# Tags
tag_q_df = pd.read_csv('./Datasets/provided_csvs/tag_questions.csv')
tags_df = pd.read_csv('./Datasets/provided_csvs/tags.csv')

#Professional
pros_df = pd.read_csv('./Datasets/provided_csvs/professionals.csv')

#### Unused CSV's

Given limited time, I only worked with 7/15 data sets. I did not include the tag_users.csv because it was not compatible with the other data sets and we would have been simulation inaccurate information. The remaining 8 data sets were not used because they were not important for predicting which questions are most likely to get answered. Merging these 8 data sets would also skew the information.

In [3]:
#Unused Tags
tag_users_df = pd.read_csv('./Datasets/provided_csvs/tag_users.csv')

# Others
coms_df = pd.read_csv('./Datasets/provided_csvs/comments.csv')
emails_df = pd.read_csv('./Datasets/provided_csvs/emails.csv')
group_mem_df = pd.read_csv('./Datasets/provided_csvs/group_memberships.csv')
groups_df = pd.read_csv('./Datasets/provided_csvs/groups.csv')
school_mem_df = pd.read_csv('./Datasets/provided_csvs/school_memberships.csv')
students_df = pd.read_csv('./Datasets/provided_csvs/students.csv')
matches_df = pd.read_csv('./Datasets/provided_csvs/matches.csv')

#### Throughout this notebook you'll notice I do the same thing for each merge
1. View the dataframe's first few rows
2. Check the shape of the dataframe (to ensure it merged the way expected)
3. Rename columns (so that when merging the column names match). *Compatible columns were identified after manual examination of the data.*
4. Rename columns if the column name will be confusing once merged (i.e. there's a 'score' column in both the questions and answers df)

5. Merging, all the merges are merged on a column shared by both dataframes with a left merge 

* At the end of the notebook I export it as a CSV to the Datasets file

<span style ='color:red'> pic of left merge

## Merging Dataframes with Answers Information

#### `answers_df`

In [4]:
print("shape:", answers_df.shape)
answers_df.head(2)

shape: (51123, 5)

,answers_id,answers_author_id,answers_question_id,answers_date_added,answers_body
0,4e5f01128cae4f6d8fd697cec5dca60c,36ff3b3666df400f956f8335cf53e09e,332a511f1569444485cf7a7a556a5e54,2016-04-29 19:40:14 UTC+0000,<p>Hi!</p>\n<p>You are asking a very interesti...
1,ada720538c014e9b8a6dceed09385ee3,2aa47af241bf42a4b874c453f0381bd4,eb80205482e4424cad8f16bc25aa2d9c,2018-05-01 14:19:08 UTC+0000,<p>Hi. I joined the Army after I attended coll...

#### `answer_scores_df`

In [5]:
print("shape:", answer_score_df.shape)
answer_score_df.head()

shape: (51138, 2)

                                 id  score
0  7b2bb0fc0d384e298cffa6afde9cf6ab      1
1  7640a6e5d5224c8681cc58de860858f4      5
2  3ce32e236fa9435183b2180fb213375c      2
3  fa30fe4c016043e382c441a7ef743bfb      0
4  71229eb293314c8a9e545057ecc32c93      2

#### Renaming `id` to `answer_id` to match the answers dataframe for merging

In [6]:
answer_score_df.rename(columns={'id': 'answers_id'}, inplace=True)
answer_score_df.head(1)

                         answers_id  score
0  7b2bb0fc0d384e298cffa6afde9cf6ab      1

#### Merging `answers_df` and `answer_scores`  dataframes on `answer_id`, how ='left', and saving new dataframe as `df_answer`

In [7]:
# Merge two Dataframes on single column 'answers_id'
df_answer = answers_df.merge(answer_score_df, on='answers_id', how='left')
print("shape:", df_answer.shape)
df_answer.head(2)

shape: (51123, 6)

,answers_id,answers_author_id,answers_question_id,answers_date_added,answers_body,score
0,4e5f01128cae4f6d8fd697cec5dca60c,36ff3b3666df400f956f8335cf53e09e,332a511f1569444485cf7a7a556a5e54,2016-04-29 19:40:14 UTC+0000,<p>Hi!</p>\n<p>You are asking a very interesti...,0.0
1,ada720538c014e9b8a6dceed09385ee3,2aa47af241bf42a4b874c453f0381bd4,eb80205482e4424cad8f16bc25aa2d9c,2018-05-01 14:19:08 UTC+0000,<p>Hi. I joined the Army after I attended coll...,0.0

#### Renaming `score` to `answer_score` to avoid confusion in later merges

In [8]:
df_answer.rename(columns = {'score':'answers_score'}, inplace=True)

---
# Merging DataFrames with Question Information:

#### `q_score_df`

In [9]:
print("shape:", q_score_df.shape)
q_score_df.head(2)

shape: (23928, 2)

                                 id  score
0  38436aadef3d4b608ad089cf53ab0fe7      5
1  edb8c179c5d64c9cb812a59a32045f55      4

#### Renaming the `id` column in `q_score_df` to match the `questions_id` column in `ques_df` so we can merge the two DataFrames on `questions_id`

In [10]:
q_score_df.rename(columns={'id':'questions_id'}, inplace= True)

#### `ques_df`

In [11]:
print("shape:", ques_df.shape)
ques_df.head(2)

shape: (23931, 5)

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...

#### Creating a new DataFrame `questions_df` from the merged `ques_df` and `q_score_df`

In [13]:
df_questions = ques_df.merge(q_score_df, on = 'questions_id', how='left')
print("shape:", df_questions.shape)
df_questions.head(2)

shape: (23931, 6)

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body,score
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...,1.0
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...,5.0

#### Renaming `score` to `questions_score` to avoid confusion when merging later

In [14]:
df_questions.rename(columns = {'score':'questions_score'}, inplace=True)

---
---
---

## Merging the Tag Dataframes

### <span style = 'color:red'> if I decide that I'll only use 2/3 tag csv's make sure to note why

Merging the `tag_q_df` and the `tags_df`. We're merging on the `tag_id` column with a left merge. We're doing this to keep all the information in the tag_q_df while matching up (and sometimes duplicating) information in the tags_df. 

We're not merging the `tag_users` dataframe because 
    1) the information isn't crucial to later EDA and modeling and more importantly 
    2) because we'd either be making up information, duplicating rows that shouldn't be duplicated, or losing significant amounts of information. 

Since it doesn't add that much value, we're choosing to not merge the `tag_users` dataframe and leave it as a standalone file. 

#### <span style = 'color:red'> insert image is we can

#### Renaming the `tag_questions_question_id` column in `tag_q_df` to match the `questions_id` column in `questions_df` so we can merge the two DataFrames on `questions_id`
<span style = 'color:red'> did this end up being done? get rid of this cell/description of coming code? </span>

In [15]:
print("shape:", tag_q_df.shape)
tag_q_df.head(2)

shape: (76553, 2)

   tag_questions_tag_id         tag_questions_question_id
0                 28930  cb43ebee01364c68ac61d347a393ae39
1                 28930  47f55e85ce944242a5a347ab85a8ffb4

In [16]:
print("shape:", tags_df.shape)
tags_df.head(2)

shape: (16269, 2)

   tags_tag_id     tags_tag_name
0        27490           college
1          461  computer-science

#### Renaming `tag_questions_tag_id` to `tag_id` in `tag_q_df` and `tags_tag_id` in `tags_df` so they match and we can merge on them.

In [17]:
tag_q_df.rename(columns ={'tag_questions_tag_id': 'tag_id'}, inplace = True)
tags_df.rename(columns={"tags_tag_id": "tag_id",  'tags_tag_name':'tag_name'}, inplace=True)

#### Merging the tag columns on `tag_id`. We doing a left merge because we want to keep all the information in the `tag_q_df` and don't mind if the `tags_df` is duplicated or deleted.

In [18]:
df_tags = tag_q_df.merge(tags_df, on = "tag_id", how="left")

In [19]:
print("shape:", df_tags.shape)
df_tags.head(2)

shape: (76553, 3)

   tag_id         tag_questions_question_id tag_name
0   28930  cb43ebee01364c68ac61d347a393ae39    minor
1   28930  47f55e85ce944242a5a347ab85a8ffb4    minor

## <span style = 'color:red'> Explain

#### Exporting the tags dataframe so we can do specific EDA on the tags without messing up the other dataframes or merged data

In [20]:
df_tags.to_csv('./Datasets/merged_tag_df.csv',index=False)

#### Renaming the `tag_questions_question_id` column to `questions_id` so that it's compatible to the quetions

In [21]:
df_tags.rename(columns={'tag_questions_question_id': "questions_id"}, inplace = True)

---
---
---

### Merging Tags to Questions Dataframes

In [22]:
# tag_ques_df = df_questions.merge(df_tags, on = 'questions_id', how='left')

In [23]:
# print("shape:", tag_ques_df.shape)
# tag_ques_df.head(2)

#### Renaming `score` to `questions_score` to avoid confusion when merging `tag_ques_df` and answers DataFrames

In [24]:
# tag_ques_df.rename(columns = {'score':'questions_score'}, inplace=True)

In [25]:
# tag_ques_df.shape
# tag_ques_df.head(2)

## Merging `tag_ques_df` to the `df_answers` dataframe and saving as merged

#### Renaming `answers_question_id` to `question_id`  so we can merge the questions and answers `DataFrames`

In [26]:
df_answer.rename(columns = {'answers_question_id' : 'questions_id'}, inplace=True)

#### Merged questions and asnwers DataFrames

In [27]:
print("shape:", df_answer.shape)
df_answer.head(2)

shape: (51123, 6)

,answers_id,answers_author_id,questions_id,answers_date_added,answers_body,answers_score
0,4e5f01128cae4f6d8fd697cec5dca60c,36ff3b3666df400f956f8335cf53e09e,332a511f1569444485cf7a7a556a5e54,2016-04-29 19:40:14 UTC+0000,<p>Hi!</p>\n<p>You are asking a very interesti...,0.0
1,ada720538c014e9b8a6dceed09385ee3,2aa47af241bf42a4b874c453f0381bd4,eb80205482e4424cad8f16bc25aa2d9c,2018-05-01 14:19:08 UTC+0000,<p>Hi. I joined the Army after I attended coll...,0.0

## <span style = 'color:red'> test: We're making it a left merge on the questions df

In [28]:
# merged_df = df_answer.merge(tag_ques_df, on='questions_id', how='left', indicator=True)
# merged_df.head(2)

In [29]:
# merged_df = tag_ques_df.merge(df_answer, on='questions_id', how='left')
# print("shape:", merged_df.shape)
# merged_df.head(2)

In [30]:
qa_merged_df = df_questions.merge(df_answer, on='questions_id', how='left')
print("shape:", qa_merged_df.shape)
qa_merged_df.head(2)

shape: (51944, 11)

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body,questions_score,answers_id,answers_author_id,answers_date_added,answers_body,answers_score
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...,1.0,4e5f01128cae4f6d8fd697cec5dca60c,36ff3b3666df400f956f8335cf53e09e,2016-04-29 19:40:14 UTC+0000,<p>Hi!</p>\n<p>You are asking a very interesti...,0.0
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...,5.0,ada720538c014e9b8a6dceed09385ee3,2aa47af241bf42a4b874c453f0381bd4,2018-05-01 14:19:08 UTC+0000,<p>Hi. I joined the Army after I attended coll...,0.0

In [31]:
qa_merged_df.to_csv("./Datasets/qa_merged_df.csv", index=False)

## <span style = 'color:red'> This size isn't right, it should be about 55k. For some reasons it's adding both the questions and asnwers data frames.

#### Exporting as merged csv:

In [32]:
# merged_df.to_csv("./Datasets/merged_df.csv", index=False)

---
---
---
After doing some EDA, I realized that a good dataframe to EDA on would be `answers_df`, `ques_df`, and `tag_q_df`

In [33]:
answers_df.head(2)
answers_df.rename(columns={'answers_question_id' :'questions_id'}, inplace=True)

In [34]:
ques_df.head(2)

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...

In [35]:
qa_merge = ques_df.merge(answers_df, on = 'questions_id', how = 'left')

In [36]:
qa_merge.head(2)

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body,answers_id,answers_author_id,answers_date_added,answers_body
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...,4e5f01128cae4f6d8fd697cec5dca60c,36ff3b3666df400f956f8335cf53e09e,2016-04-29 19:40:14 UTC+0000,<p>Hi!</p>\n<p>You are asking a very interesti...
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...,ada720538c014e9b8a6dceed09385ee3,2aa47af241bf42a4b874c453f0381bd4,2018-05-01 14:19:08 UTC+0000,<p>Hi. I joined the Army after I attended coll...

In [37]:
qa_merge.isnull().sum()

questions_id              0
questions_author_id       0
questions_date_added      0
questions_title           0
questions_body            0
answers_id              821
answers_author_id       821
answers_date_added      821
answers_body            822
dtype: int64

In [38]:
qa_merge['was_answered'] = qa_merge['answers_id'].notnull().astype(int)

In [39]:
qa_merge = qa_merge.drop(columns=['answers_id', 'answers_author_id','answers_date_added', 'answers_body'])

In [40]:
print("shape:", qa_merge.shape)
qa_merge.head(2)

shape: (51944, 6)

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body,was_answered
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...,1
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...,1

In [41]:
tag_q_df.head()

   tag_id         tag_questions_question_id
0   28930  cb43ebee01364c68ac61d347a393ae39
1   28930  47f55e85ce944242a5a347ab85a8ffb4
2   28930  ccc30a033a0f4dfdb2eb987012f25792
3   28930  e30b274e48d741f7bf50eb5e7171a3c0
4   28930  3d22742052df4989b311b4195cbb0f1a

In [42]:
tag_q_df['has_tag'] = tag_q_df['tag_questions_question_id'].notnull().astype(int)
tag_q_df.head(2)

   tag_id         tag_questions_question_id  has_tag
0   28930  cb43ebee01364c68ac61d347a393ae39        1
1   28930  47f55e85ce944242a5a347ab85a8ffb4        1

In [43]:
has_tag_df = tag_q_df.drop(columns = 'tag_id')
has_tag_df = has_tag_df.drop_duplicates()

In [44]:
print("shape:", has_tag_df.shape)
has_tag_df.head(2)

shape: (23288, 2)

          tag_questions_question_id  has_tag
0  cb43ebee01364c68ac61d347a393ae39        1
1  47f55e85ce944242a5a347ab85a8ffb4        1

In [45]:
has_tag_df.rename(columns = {'tag_questions_question_id': 'questions_id'}, inplace=True)
has_tag_df.head(2)

                       questions_id  has_tag
0  cb43ebee01364c68ac61d347a393ae39        1
1  47f55e85ce944242a5a347ab85a8ffb4        1

In [46]:
merged_qa_tag_df = qa_merge.merge(has_tag_df, on="questions_id", how='left')
print("shape:", merged_qa_tag_df.shape)
merged_qa_tag_df.head(2)

shape: (51944, 7)

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body,was_answered,has_tag
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...,1,1.0
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...,1,1.0

#### Exporting `merged_qa_tag_df` to csv for EDA

In [47]:
# merged_qa_tag_df.to_csv('./Datasets/merged_qa_tag_df.csv', index=False)

---
---
---

In [48]:
df_answer.head(2)

,answers_id,answers_author_id,questions_id,answers_date_added,answers_body,answers_score
0,4e5f01128cae4f6d8fd697cec5dca60c,36ff3b3666df400f956f8335cf53e09e,332a511f1569444485cf7a7a556a5e54,2016-04-29 19:40:14 UTC+0000,<p>Hi!</p>\n<p>You are asking a very interesti...,0.0
1,ada720538c014e9b8a6dceed09385ee3,2aa47af241bf42a4b874c453f0381bd4,eb80205482e4424cad8f16bc25aa2d9c,2018-05-01 14:19:08 UTC+0000,<p>Hi. I joined the Army after I attended coll...,0.0

In [49]:
df_answer['was_answered'] = 1

In [50]:
was_ans_df = df_answer[['questions_id', 'was_answered', 'answers_score']]

In [51]:
ques_df.head(2)

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...

In [52]:
q_answered_df = df_questions.merge(was_ans_df ,on='questions_id', how='left')
q_answered_df.head()

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body,questions_score,was_answered,answers_score
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...,1.0,1.0,0.0
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...,5.0,1.0,0.0
2,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...,5.0,1.0,0.0
3,4ec31632938a40b98909416bdd0decff,f2c179a563024ccc927399ce529094b5,2017-02-08 19:13:38 UTC+0000,Will going abroad for your first job increase ...,I'm planning on going abroad for my first job....,2.0,1.0,0.0
4,2f6a9a99d9b24e5baa50d40d0ba50a75,2c30ffba444e40eabb4583b55233a5a4,2017-09-01 14:05:32 UTC+0000,To become a specialist in business management...,i hear business management is a hard way to ge...,2.0,1.0,0.0

In [53]:
q_answered_df.head()

,questions_id,questions_author_id,questions_date_added,questions_title,questions_body,questions_score,was_answered,answers_score
0,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...,1.0,1.0,0.0
1,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...,5.0,1.0,0.0
2,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...,5.0,1.0,0.0
3,4ec31632938a40b98909416bdd0decff,f2c179a563024ccc927399ce529094b5,2017-02-08 19:13:38 UTC+0000,Will going abroad for your first job increase ...,I'm planning on going abroad for my first job....,2.0,1.0,0.0
4,2f6a9a99d9b24e5baa50d40d0ba50a75,2c30ffba444e40eabb4583b55233a5a4,2017-09-01 14:05:32 UTC+0000,To become a specialist in business management...,i hear business management is a hard way to ge...,2.0,1.0,0.0

In [54]:
q_answered_df.to_csv('./Datasets/merged_4_modeling.csv', index=False)